Tekla Open API Reference for Tekla Structures 2025
Polygon Constructor
 Initializes a new polygon instance with empty attributes.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polygon()
Public Sub New
See Also
Reference
Polygon Class
Tekla.Structures.Model Namespace